In [4]:
import time
import pandas as pd

from pyspark.sql import functions as F
from pyspark.sql import SparkSession
spark_conn = SparkSession.builder.appName("Pyspark demo") \
    .master("local[*]").getOrCreate()

In [17]:
df_spark = spark_conn.read.csv("emp1.csv",header=True)

In [16]:
df_pd = pd.read_csv("emp1.csv")

In [18]:
df_spark.show()

+-------+--------------+
|enumber|         ename|
+-------+--------------+
|   1001|   Aarav Mehta|
|   1002|   Isha Sharma|
|   1003|    Rajiv Nair|
|   1004|   Kavya Reddy|
|   1005|  Aditya Patel|
|   1001|   Aarav Mehta|
|   1002|   Isha Sharma|
|   1003|    Rajiv Nair|
|   1004|   Kavya Reddy|
|   1005|  Aditya Patel|
|   1006|    Priya Iyer|
|   1007|   Arjun Singh|
|   1008|    Neha Verma|
|   1009| Devansh Desai|
|   1010|  Ananya Joshi|
|   1011|  Rohan Kapoor|
|   1012|   Simran Kaur|
|   1013|    Ayan Dutta|
|   1014|  Tanya Bansal|
|   1015|Manav Malhotra|
+-------+--------------+
only showing top 20 rows

In [19]:
df_pd

    enumber           ename
0      1001     Aarav Mehta
1      1002     Isha Sharma
2      1003      Rajiv Nair
3      1004     Kavya Reddy
4      1005    Aditya Patel
5      1001     Aarav Mehta
6      1002     Isha Sharma
7      1003      Rajiv Nair
8      1004     Kavya Reddy
9      1005    Aditya Patel
10     1006      Priya Iyer
11     1007     Arjun Singh
12     1008      Neha Verma
13     1009   Devansh Desai
14     1010    Ananya Joshi
15     1011    Rohan Kapoor
16     1012     Simran Kaur
17     1013      Ayan Dutta
18     1014    Tanya Bansal
19     1015  Manav Malhotra
20     2001      Shruti Rao
21     2002     Kunal Dixit
22     2003     Sanya Dubey
23     2010    Harshit Jain
24     2011    Ritika Ghosh
25     3010    Harshit Jain
26     4011    Ritika Ghosh

In [22]:
df_spark.limit(20).subtract(df_spark.limit(10)).show()

+-------+--------------+
|enumber|         ename|
+-------+--------------+
|   1006|    Priya Iyer|
|   1007|   Arjun Singh|
|   1008|    Neha Verma|
|   1009| Devansh Desai|
|   1010|  Ananya Joshi|
|   1011|  Rohan Kapoor|
|   1012|   Simran Kaur|
|   1013|    Ayan Dutta|
|   1014|  Tanya Bansal|
|   1015|Manav Malhotra|
+-------+--------------+

In [23]:
df_pd.head(20).tail(10).tail(5)

    enumber           ename
15     1011    Rohan Kapoor
16     1012     Simran Kaur
17     1013      Ayan Dutta
18     1014    Tanya Bansal
19     1015  Manav Malhotra